[
{"company_name": "inviocare", "company_desc": ["Inviocare is an innovative cosmetic specialist clinic that offers well-known cosmetic treatments with the safest, best and latest equipment on the market.", "The clinic is located in central Copenhagen in beautiful newly renovated premises and the atmosphere is exclusive, quiet and discreet.", "We work extremely professionally at the clinic and our team is youthful, well-trained, incredibly competent and certified in all treatments. We always make sure to be up to date with the latest techniques and attend courses in Denmark and abroad.", "We weigh professionalism, honesty, thoroughness and security incredibly high. Customer safety is number one and we give our customers top service as well as a good and personal guide.", "In order for you to achieve the best results, we always recommend that you book a free consultation at the clinic. Concerning some treatments, a consultation is a legal requirement and there is also 48 hours of reflection.", "Treatments we offer at Inviocare:", "At Inviocare we do not compromise on the quality of our products and we use the best products on the market:", "Juvéderm, Botox and ZO Skin Health.", "Download the report here (Only available in Danish)", "Inviocare is registered with the Board of Patient Safety to perform cosmetic treatments such as laser, filler, Botox and other medical treatments.", "Cosmetic treatments include treatments where cosmetic considerations are crucial and the main purpose is to change or improve appearance. The performance of cosmetic treatments is regulated by Cosmetic Treatments Order No. 1245 of October 2007.", "As a patient, you will find that some cosmetic treatments require a 48 hour or 1 week of consideration, from consultation to treatment. Other treatments can be done at the first clinic consultation. These rules are in place to ensure that you are thoroughly informed and have had time to decide for a possible treatment.", "Denmark has a restrictive and comprehensive legislation in the area of cosmetic treatment. The legislation intends to maintain patient safety and quality, and the Board of Patient Safety therefore supervises registered cosmetic clinics.", "The Board of Patient Safety conducted an inspection at Inviocare on December 18, 2018. The attached report confirms that Inviocare lived up to all measurement points in the legislation. This testifies to a high level of health education.", "We look forward to welcoming you.", "Palaegade 4, 3. th.", "1261 Copenhagen K", "Phone: +45 51 88 15 34", "cph@inviocare.com", "We refer to Jeudan car park at “Skuespilhuset”.", "Sankt Annæ Plads 32, 1250 Copenhagen K", "Read about our cookie and privacy policy", " ", "Read more here", "Clinic:", " Palaegade 4, 3. th.", " DK - 1261 Copenhagen K", " VAT: 37231304", " Phone: +45 51 88 15 34", " ", "cph@inviocare.com", " Please only contact us outside our telephone hours concerning emergency inquiries.", " Phone: +45 26 33 18 83", "Copyright © Inviocare – The future of aesthetics", "Husk at følge os på sociale medier for at modtage gode tilbud og info om nye behandlinger.", "\n", "Remember to follow us on social media to receive great offers and info about new treatments.", "\n"]}
]