[
{"company_name": "livecollective", "company_desc": ["WE CREATE ", "POWERFUL ", "LIVE ", "EXPERIENCES", "Onsite & Online", " ", "We believe that creating ", "excellent Live Experiences", " is a matter of having the right professional individuals do what they do best and work together as a team to meet defined objectives and achieve common goals.", "When engaging with Live Collective ", "your project and audience is the center of everything!", "We set the right team", " for your given project and situation – design the planning processes to respect your corporate culture and specific needs – create real value out of your budget… and together we will all have fun doing it! ", "Excellent project management is the keystone of our business – and the keystone of live event planning!", " ", "Only when we have the purpose of the event clearly defined,  we can effectively design and implement a sharp concept!", " We respect your corporate culture and strategy, when we assist you in unfolding the right creative concept!", "We will create a clear setting, where both your performers and audience are comfortable!", " ", "Fully briefed professional staff on all posts will make sure that everything runs smoothly onsite!", " ", "We evaluate the results to the defined purpose and ROI’s that we defined – create real value for your further strategic plans. ", "Live Collective is ambitious and committed to the implementation of sustainable products and procedures in all aspects of our work. ", "We are well educated in the Sustainable Development Goals as defined by the UN and we work in accordance with the Event Councils approach to the implementation of all 17 Sustainable Development Goals for sustainable event production .  ", "Check out the Experience Gallery for picures form previous projects with our great clients", "We love to meet new people and visit good clients, so please shout out and we will come by and hear more about your next live engagements and give you our inputs – it will cost you nothing but a cup of coffee.", " ", "Email: Anette@livecollective.dk ", "Phone: +45 2629 2135"]}
]