[
{"company_name": "tawi", "company_desc": ["Home", " ", "Why TAWI", " ", "About TAWI", "Swedish inventor since 1923", " ", "TAWI is a global brand to rely on with a proven track record to deliver smart lifting solutions.", "TAWI has an old history. The company was registered in 1923 as Tage Wiberg limited company. Originally it was a manufacturing company within the Swedish steel industry.", "In the 1940’s the company was acquired by Gunnebo, one of the largest competitors at the time. Folke Wilhelmsson became manager.", "The company moved from Gothenburg to Kungsbacka and Leif Emblad took over as CEO after his father. Oil trading became the new business focus, along with screw locking mechanism. The business was prosperous until the oil crisis hit.", "In 1989 Convacor, manufacturer of VacuMyggan vacuum lifter, was acquired. TAWI launched the vacuum lifter on the international market, starting the journey to become market leader in manual lifting equipment.", "Protema and Lyftman were acquired in 1997, adding lifting trolleys and crane systems to the product range. Through innovation of new lifting equipment, like the unique wire hoist, TAWI could now deliver complete lifting systems, setting the company apart from competitors.", "After 37 years of successful leadership, Leif Emblad sold the company to SEB Private Equity. Thomas Bräutigam was appointed new CEO and Christer Nilsson became Chairman of the Board. The first year with new owners and management resulted in strong international growth and innovative product development.", "In January 2020 TAWI Group was acquired by Piab Group. Thomas Bräutigam, CEO of TAWI Group says: “Piab’s long history of innovation in vacuum technology and global market access will allow for TAWI to further strengthen its offer to customers in need of smart and ergonomic lifting solutions. By joining the Piab Group, TAWI joins an excellent global company, a leading innovator in the vacuum technology market and together we will strengthen our leading position in the semi-automated lifting market.”", "2023 marks the TAWI brand’s 100", "th", " anniversary.", "The TAWI brand represents 100 years of innovations, transformations and partnerships. At Piab Lifting Automation, we call it 100 years of smart lifting. With exploration, leadership and commitment at heart, we are ready to embrace what the next 100 years hold.", "Since January 2020, TAWI is part of Piab group.", "Piab is a global leader in lifting, gripping, and moving solutions for the automated world. We help our customers grow by providing products and smart solutions that transform their businesses through increased automation.", "Our customers are in just about every sector, including the food, automotive, logistics, e-commerce and pharmaceutical industries. We are proud of our 1000+ employees who serve customers in almost 100 countries across the world, all of who work together to create and innovate within the advancement and technological evolution of ergonomic lifting, automation and robotics.", " ", " ", "Swedish inventors since 1923", "2023 marks the brand TAWI’s 100", "th", " anniversary. As TAWI turns 100, we reflect on our journey. We have grown and transformed, expanding our reach and influence in the industry over time. At TAWI, we have always been proud of who we are. Proud of our long history. Proud of our relentless pursuit of innovation and dedication.", "Our", " strength", " lies", " in", " our", " extensive", " knowledge", " and", " experience", " in", " developing", " innovative", " solutions", ",", " our motivated commercial team, and a reliable service and installation process for all of our solutions. This successful formula is only made possible through trust and a collaborative spirit, the true catalysts of our success. ", "As we look ahead, we will remain committed to embracing new technology – a practice that has been the driving force behind our success for the past 100 years, and we are confident it will remain so for the next chapter of our company.", "That’s what defines the TAWI brand and our future.", "Reach out to us anytime and we’ll be happy to help you.", " Do you need an urgent response, please call us directly on +46 300 185 00 (8am-5pm, GMT+1)", "Please specify what you want to lift with measures and weight, size of working area, and lifting height to get as accurate a quote as possible.", "Are you unsure?", " Call us at +46 300 185 00 (8am-5pm, GMT+1) for advice", "TAWI AB", " Box 10205 ", " 434 23                                 Kungsbacka ", " Sweden", "Welcome to Piab Lifting Automation Division. We produce, market and sell TAWI lifting solutions.", " "]}
]