[
{"company_name": "whirlpool", "company_desc": ["Buy 2 major appliances save 5% | Buy 3 or more, save 10%❖. ", "See Details", "❖", "Ends March 13, 2024 at 11:59PM EST. Excludes ground shipped products. Discount taken off regular or sale price excluding taxes, delivery, install/uninstall and haul-away. Only valid for new orders on whirlpool.com. Major appliances limited to washers, dryers, refrigerators, ranges, cooktops, dishwashers, microwaves and hoods. While supplies last.", "Providing your exact location will allow us to ensure our products are available in your area.", "ZIP Code:", "Hello,", "\n                            ", "\n                        All Merchandise in Cart:\n                    ", "\n                        Order Discount:\n                    ", "\n                        Total: (Before Taxes, Shipping, and Services):\n                    ", "Link your shopping cart across all your devices!", " to your account to save and access your shopping cart on your desktop, tablet, or mobile device.", "Be sure to check out our latest ", "offers", " to start saving!", "\n                            Cooktops\n                        ", "\n                            Dishwashers\n                        ", "\n                            Microwaves\n                        ", "\n                            Refrigeration \n                        ", "\n                            Ranges\n                        ", "\n                            Smart Appliances\n                        ", "\n                            Range Hoods\n                        ", "\n                            Wall Ovens\n                        ", "\n                            Washers\n                        ", "\n                            Dryers\n                        ", "\n                            Laundry Sets\n                        ", "\n                            Commercial Laundry\n                        ", "\n                            Smart Appliances\n                        ", "\n                            Home Solutions\n                        ", "\n                            Water Filters\n                        ", "\n                            Appliance Cleaners\n                        ", "\n                            Kitchen Parts & Accessories\n                        ", "\n                            Laundry Parts & Accessories\n                        ", "\n                            Appliance Sales\n                        ", "\n                            Whirlpool® Outlet\n                        ", "\n                            Discount Programs\n                        ", "\n                            Financing\n                        ", "\n                            Product Support\n                        ", "\n                            Repair or Replace\n                        ", "Additional ", "contact info and hours of operation.", "\n      ", "*", "\n      Required Information\n    ", "\n        ", "Forgot your Password?", "\n      ", "\n            ", "or", "\n        ", "Complete Your Account", "Whirlpool will be using the following information we gathered from the external platform you selected to create your account.", "block.addtocart.message", "\n                        Session Time Out\n                    ", "\n                            Your session is about to expire.\n                        ", "\n                        Session Timed Out\n                    ", "\n                            Your session has expired.\n                        ", "\n          Whirlpool brand is focused on improving how families give and get the care they need.\n        ", "We understand the power of simple acts of care and celebrate the day-in, day-out sacrifices every family makes. Learn more about ", "Every day, care", "®", ".", "\n", "\nOur home appliances are designed with the right technologies and innovations to help give families the care they need. Whether that means using the Whirlpool", "®", " App to get dinner started from another room", "1", " or letting the Load & Go", "™", " Dispenser add the right amount of detergent to every laundry load, Whirlpool", "®", " Appliances fit family life at every turn.", "\n", "Whirlpool Corporation started in 1911 as a small company in Benton Harbor, Michigan. For more than 100 years, its flagship brand has driven innovations from introducing the very first automatic washing machine in 1948 to winning more than 20 CES", "®", " Innovation Awards.", "\n", "\nWe’re proud of the American heritage and ingenuity that drive our continued pursuit of ", "purposeful innovation", ".", "Having access to clean clothes can help keep students in school. Learn how Whirlpool has helped end the dropout cycle by ", "providing laundry pairs in schools", " since 2015.", "Get consistent, quality care when you purchase a Whirlpool", "®", " Appliance. Our customer care team is ready to help you with everything from setting up service appointments to proper cleaning and maintenance techniques. And when you ", "buy from Whirlpool.com", ", we’re here for you through payment options, delivery, installation and support, so you can be confident all along the way.", "Learn more about Whirlpool brand and Whirlpool Corporation with the latest news and press releases.", "\n", "Explore career opportunities within the Whirlpool brand team and Whirlpool Corporation.", "Read the latest financial news from Whirlpool brand and Whirlpool Corporation.", "Learn more about our parent company.", "1. Appliance must be set to remote enable. WiFi & App Required. Features subject to change. Details and privacy info at ", "whirlpool.com/connect", ".", "\n", "CES® is a registered trademark of the Consumer Technology Association.", "\n                            ", " Model:  ", "\n                            ", "\n                        ", "\n                            ", "Color:  ", "\n                            ", "\n                        ", "\n                            ", "Quantity:  ", "\n                            ", "\n                        ", "\n                                ", "Subscribe to Receive  ", "\n                                ", ":\n                            ", "\n                                ", "\n                            ", "\n                            ", "Total Price:  ", "\n                            ", "\n                        ", "\n                     Connect with Us\n                  ", " ", "®/™ © 2023 Whirlpool. All rights reserved. All other trademarks are owned by their respective companies.", "This online merchant is located in the United States at 600 West Main Street, Benton Harbor, MI 49022.", "The listed price may differ from actual selling prices in your area", "Hang in there, we are looking for alternate products just for you.", "Have You Considered These?", "We use your information in accordance with our ", "privacy policy", ".", "on your first purchase with a new ", "account.", "1", "Use promo code LAUNDRYINSTALL. Discount applied in ", "cart.", "2", "Log in and use code SUB30SNL for 30% off your first water filter subscription. Auto-refills unless canceled. See disclaimer for exact refill ", "pricing.", "3", "on select appliances.", "Discount applied in ", "cart.", "5", "Discount applied in ", "cart.", "6", "1", "Ends March 31, 2024 11:59PM EST. Discount taken off sale price excluding taxes, delivery, install/uninstall and haul-away. Only valid for new orders on whirlpool.com. Offer subject to change. No cash value. One-time use only.", "2", "Ends March 31, 2024 11:59PM EST. Availability of delivery, haul-away and install services vary by location - see checkout for services available to you. Excludes ground shipped products. Only valid on new orders on whirlpool.com. Major appliances limited to washers and dryers.", "3", "Ends March 31, 2024 at 11:59PM EST. Must use code SUB30SNL at checkout. Subscription discount taken off regular price excluding taxes and shipping. 1-pack of Filter 1, 2, 3, 4, 5 and A are $47.99 for refills, 1-Pack of Filter 6 & Ice Filter are $39.99 for refills, 2-pack of Filter 1, 2, 3, 4, 5 and A are $86.38 for refills, 2-pack of Filter 6 are $71.98 for refills. Only valid for new subscription orders on Whirlpool.com. Offer subject to change. No cash value. See subscription terms for details.", "4", "5", "Ends April 24, 2024 at 11:59PM EST. Excludes ground shipped products. Discount taken off regular or sale price excluding taxes, delivery, install/uninstall and haul-away. Only valid for new orders on maytag.com. Major appliances limited to washers, dryers, refrigerators, ranges, cooktops, dishwashers, microwaves and hoods. While supplies last.", "6", "Ends April 24, 2024 11:59PM EST. Availability of delivery, haul-away and install services vary by location - see checkout for services available to you. Excludes ground shipped products. Dollar threshold based on sale price of in-home delivery products excluding taxes, delivery, install/uninstall, and haul-away. Only valid on new orders on whirlpool.com. Major appliances limited to washers, dryers, refrigerators, ranges, cooktops, dishwashers, microwaves and hoods. Cannot be combined with Professional discounts.", "7"]}
]